# ── Terminal & Shell ──────────────────────────────────────────────────────────
cask "iterm2"
cask "alacritty"
cask "ghostty"
brew "coreutils"
brew "fd"
brew "ripgrep"
brew "jq"
brew "htop"
brew "tree-sitter"
brew "wget"

# ── Development ───────────────────────────────────────────────────────────────
brew "git"
brew "gh"
brew "uv"
brew "node"

# ── Fonts ─────────────────────────────────────────────────────────────────────
cask "font-hack-nerd-font"

# ── Apps ──────────────────────────────────────────────────────────────────────
cask "claude-code"
cask "cursor"
cask "visual-studio-code"
cask "firefox"
cask "google-chrome"
cask "discord"
cask "spotify"
cask "obs"
cask "telegram-desktop"
